{
  "free_sections": {
    "personality": [
      "نتا شخصية قوية وهادئة، كتعرف تاخد القرارات فالصعيب. قلبك كبير ودايما كتحاول تساعد النايبين عليك.",
      "ناس كيقولو عليك متسرع، ولكن الحقيقة بلي كتعرف شنو كبغي من لحياة. عندك بصيرة حادة.",
      "شخصية كتخش لقلوب الناس بسهولة. عندك الكاريزما والذكاء العاطفي اللي كيخليو الناس يثقو فيك.",
      "نتي بنت الحكمة والطمأنينة. كتعرفي تربي الضحكة والجدية فآن واحد، وهادي موهبة نادرة.",
      "عندك روح المغامرة وكتبغي التجديد، ولكن فالنفس الوقت عندك جذور عميقة فالعائلة والتقاليد.",
      "شخصية فنية وخلاقية، كتشوفي الجمال فالأشياء البسيطة وكتعرفي تعبرو بطريقتك الخاصة.",
      "كتمشي فالحياة بحذر وحكمة، كتاخد الوقت باش تتفكري قبل ما تدي أي رد فعل.",
      "عندك الطاقة الإيجابية اللي كتنشر الضو فلمكان اللي كتدخليه. الناس كيبغيو يقربو منك.",
      "قلبك ناعم وحساس، كتتأثري بسرعة بالقصص والمشاعر، ولكن فالنفس وقت كتعرفي تبانو قوية.",
      "عندك الذكاء العملي، كتعرف تحل المشاكل بطرق مبتكرة وخارجة على المألوف.",
      "نتا الصديق الوفي، اللي كاينين عليه فالصح والضرة. عندك موهبة فسماع الناس.",
      "شخصية مليحة فالتعامل مع التحديات. العوائق كتجيب منك أحسن ما عندك.",
      "عندك حس فالدعابة وكتعرف تبدد التوتر فالجلسات. الضحكة ديالك علاج للناس اللي حوليك.",
      "كتهتمي بالتفاصيل الصغيرة اللي كاتفرق. عيناك كتشوفو أشياء كاتهرب على غيرك.",
      "نتا الهادئ فالعاصفة، اللي كيبان فالمواقف الصعبة وكاتهدي الرايبين.",
      "عندك الطاقة القيادية، ولكن بدون ما تكون متسلط. كتخلي الناس يتبعوك بحب واحترام.",
      "شخصية متواضعة ومتقدرة، كتعرف قيمة الأشياء البسيطة فالحياة.",
      "عندك المثابرة والصبر. المشاريع اللي كتبدئيها كتكملوها لين آخرها.",
      "كتهتمي بالروحانيات والمعاني العميقة. حياتك مزيان بين المادي والروحي.",
      "نتا الجسر بين الأجيال، كتفهمي الشباب والكبار وكتعرفي تواصلي بيناتهم.",
      "عندك موهبة فالتعلم السريع. الأشياء الجديدة كتستوعبها بطريقة مذهلة.",
      "شخصية رحيمة وكاتحس بالناس. هادشي كيجي من قلب صافي.",
      "عندك الإصرار اللي مامتعرفش الهزيمة. إذا عزمت على حاجة، ماترجعش بلاها.",
      "نتا مثال للتوازن. كتعرف تمزج بين المسؤولية والمتعة فالحياة.",
      "عندك روح الباحث. كتبغي تكتشف وتفهم قبل ما تحكم على أي حاجة."
    ],
    
    "year_insight": [
      "عام 2026 غادي يجيب معاه فرص ماكنتش تتوقعها. كون مستعد لاستقبال التغييرات الحلوة.",
      "هاد العام، التعلم غادي يكون المفتاح ديالك. مهارة جديدة غادي تفتح لك أبواب كتيرة.",
      "الطاقة الإيجابية ديالك غادي تزيد وكاتعدي للناس اللي حوليك. كون مصدر للضو.",
      "غادي تكون سنة التسامح والتخلي على الحقد. هادشي غادي يريحك فداخلك.",
      "2026 عام التنظيم. غادي تتعلم تدير وقتك بطريقة أحسن وتنجم تعطي لكل حاجة حقها.",
      "هاد العام، العلاقات الإيجابية غادي تزيد فالحيوات ديالك. الناس الطيبين غادي يقربو منك.",
      "غادي تكون سنة الإبداع. الأفكار الجديدة غادي تبان وتنجح تعبر عليها بطريقة خاصة.",
      "2026 غادي يعلمك فن الصبر. الأشياء اللي تستاهل كتاخد وقتها باش تولد.",
      "عام الاستقرار النفسي. حتى لو الدنيا برا متقلبة، أنت غادي تلقى الراحة فداخلك.",
      "غادي تكون سنة الاكتشافات الشخصية. غادي تتعرف على جوانب جديدة فشخصيتك.",
      "2026 عام العطاء. الكرم ديالك غادي يرجع ليك فطرق ماكنتش تتخيلها.",
      "هاد العام، الثقة فالنفس غادي تزيد. غادي تكتشف قدرات ماكنتش واعي بيها.",
      "غادي تكون سنة الحلول السهلة للمشاكل الصعبة. العقل ديالك غادي يعمل العجائب.",
      "2026 عام المغامرات الصغيرة. حتى التغييرات البسيطة غادي تجيب سعادة كبيرة.",
      "غادي تكون سنة الجرأة فالتعبير. غادي تتعلم تهدر اللي كاين فقلبك بدون خوف.",
      "هاد العام، العمل الجماعي غادي يعطيك نتائج مذهلة. تعاون مع الناس المناسبين.",
      "غادي تكون سنة الهدوء الداخلي. غادي تتعلم تهدي راسك وقت الازمات.",
      "2026 عام الذكريات الحلوة. لحظات بسيطة غادي تبقى محفورة فالذاكرة ديالك.",
      "غادي تكون سنة الإنتاجية. الأفكار غادي تتحول لمشاريع ونجاحات حقيقية.",
      "هاد العام، الحدس ديالك غادي يكون دليلك. ثق فاللحظة اللي كتجيك.",
      "غادي تكون سنة التخلص من العادات السلبية. حياة جديدة بتنظيف الداخلي.",
      "2026 عام التسويق للذات. غادي تتعلم تبان المهارات ديالك بطريقة أحسن.",
      "غادي تكون سنة الإصغاء. غادي تكتشف دروس قيمة من حكايات الناس.",
      "هاد العام، البساطة غادي تكون سر السعادة ديالك. ركز على الأساسيات.",
      "غادي تكون سنة التوازن بين العمل والحياة الشخصية. كل حاجة فمقامها."
    ]
  },
  
  "premium_sections": {
    "golden_advice": [
      "خلي الضحكة ديالك تبان أكثر. العالم محتاج للضو اللي عندك.",
      "سجل الذكريات الحلوة فقلبك. كاتساعدوك وقت الضيق.",
      "تعلم تقول لا وقتاش الحاجة ماكاتناسبكش. هادي حرية موهوبة.",
      "خصص وقت للقراءة كل يوم. الكلمات كتعلم وتفتح آفاق جديدة.",
      "سافر حتى لو لوحدك. الرحلات المنفردة كتعطي دروس خاصة.",
      "تعلم فن الصمت. فالصمت كتسمع صوت قلبك وصوت الحكمة.",
      "اقبل التغيير بحب. الحياة ماكاتوقفش، والتكيف هو الحل.",
      "اشكر على النعم الصغيرة كل صباح. الشكر كيزيد النعم.",
      "خلي عندك حلم كبير، ولكن ابدا بخطوات صغيرة وثابتة.",
      "سامح الناس، ولكن خلي الدرس يضل فذاكرتك.",
      "تعلم من الأطفال. عندهم دروس فالبساطة والفرحة.",
      "كون صادق مع نفسك دايما. الحقيقة مع النفس هي الأساس.",
      "خصص وقت للطبيعة كل أسبوع. كتضبط إيقاع القلب والفكر.",
      "حافظ على العلاقات اللي كتجيب ليك الطمأنينة والفرح.",
      "جرب حاجة جديدة كل شهر، حتى لو خايف. النمو خارج منطقة الراحة.",
      "كون لطيف مع نفسك. ماكاتطلبش من راسك أكثر من اللي تقدر.",
      "ساعد غيرك حتى لو ببسمة أو كلمة طيبة.",
      "ثق فالحدس ديالك. غالبا عندو معلومات ماكاتوصلولهاش العقل.",
      "خلي الحياة سهلة. ما تعقدها بالمبالغة فالتحليل والتفكير.",
      "عيش اللحظة. الماضي راح، والمستقبل باقي، والحاضر هو اللي كاين.",
      "نظم وقتك باش تخصص وقت للراحة. العقل المرهق مايبدعش.",
      "كون متسامح مع أخطائك. كل واحد كيخطي، المهم يتعلم.",
      "اتبع فضولك. الأسئلة كتودي للإجابات المذهلة.",
      "كافئ نفسك على الإنجازات الصغيرة. كل تقدم يستاهل الاحتفال.",
      "حافظ على التمارين الرياضية. الجسد السليم بيتحمل التحديات."
    ],
    
    "warning_challenge": [
      "حذار من الثقة العمياء. كون واعي وفرق بين الطيب والساذج.",
      "لا تهمل الصحة ديالك فوسط الانشغالات. الجسد غالي ويستاهل العناية.",
      "حذار من التأجيل. الوقت اللي كيمشي ماكاتجيبوش لوراك.",
      "لا تخلط بين التواضع والنقص فالثقة فالنفس. أنت عندك قيمة.",
      "انتبه من الحكم على الناس بسرعة. غالبا في حكاية مليحة موراهم.",
      "حذار من الغضب اللي كيخليك تهدر كلمات ماكاتبغيش.",
      "لا تنسى تخصص وقت للراحة. الماطيريال ماكاتشّي غير بالبنزين.",
      "انتبه من المقارنات. كل شخص عندو مسارو وتحدياتو الخاصة.",
      "حذار من الفراغ العاطفي. املاه باشغال ومشاريع مفيدة.",
      "لا تهمل العلاقات القديمة اللي كانت عندها قيمة فحياتك.",
      "انتبه من القرارات المتسرعة وقت الغضب أو الفرح الشديد.",
      "حذار من النسيان ديال الذات. كون موجود لنفسك قبل ما تكون للناس.",
      "لا تتصور بلي كلشي غادي يضل زيه. التغيير جزء من الحياة.",
      "انتبه من الطاقة السلبية اللي كيجيبوها ناس معينين.",
      "حذار من الروتين القاتل. خلي في مجال للتجديد فالحيوات.",
      "لا تعطي أكثر من اللي عندك. الإرهاق ماكاتخدمش معاه.",
      "انتبه من الأحكام المسبقة. افتح قلبك وعقلك للتجارب الجديدة.",
      "حذار من الكتمان الزايد. التعبير على المشاعر ضروري للصحة.",
      "لا تهمل العلامات الصغيرة. غالبا هي اللي كتجي بالخبر الكبير.",
      "انتبه من التركيز على الماضي. العيش فالحاضر هو اللي كيبنى المستقبل.",
      "حذار من القرارات المالية المتسرعة. فكر مليان قبل ما تنفق.",
      "لا تهمل العائلة. هما الدعم الحقيقي فالأوقات الصعبة.",
      "انتبه من إرضاء الناس على حساب راحتك. ماينفعش تكوني سعيد للكل.",
      "حذار من نمط الحياة غير الصحي. الصحة كنعمة ماتهدرش.",
      "لا تنسى تطور من مهاراتك. العالم كيتغير، وانت لازم تتبعه."
    ],
    
    "unexpected_opportunity": [
      "غادي تلقى فرصة عمل أو مشروع جانبي ماكنتش تتوقعه.",
      "لقاء مع شخص مؤثر غادي يغير نظرتك لشيء مهم فحياتك.",
      "غادي تكتشف هواية جديدة كتجلب ليك السعادة والراحة.",
      "فرصة للسفر أو اكتشاف مكان جديد غادي تبان فطريقك.",
      "تعلم مهارة تقنية جديدة غادي يفتح لك أبواب كتيرة.",
      "لقاء عائلي قديم غادي يجيب معاه ذكريات ومشاعر جميلة.",
      "غادي تشارك فمشروع تطوعي كيعطيك إحساس رائع بالقيمة.",
      "اكتشاف كتاب أو مسلسل أو فنان غادي يغير مزاجك للإيجاب.",
      "فرصة للتعلم من خبير فالمجال اللي كتهتم بيه.",
      "غادي تتلقى دعوة لحضور حدث مهم فالمدينة ديالك.",
      "لقاء صداقة جديدة غادي تضيف قيمة لحياتك الاجتماعية.",
      "فرصة للاستثمار فمشروع صغير كينجح بدرجة مدهشة.",
      "غادي تتعلم طبخة جديدة تصبح المفضلة عندك وعند عائلتك.",
      "اكتشاف مكان هادئ فمدينتك كتستاني ترتاح فيه.",
      "فرصة للمشاركة فورشة أو تدريب مجاني مفيد.",
      "لقاء مع شخص قديم غادي يحل سوء فهم كان موجود.",
      "غادي تتعلم تقنية جديدة للتخلص من التوتر.",
      "فرصة لتعليم مهارة عندك لشخص آخر.",
      "اكتشاف تطبيق أو أداة كتسهل عليك الحياة اليومية.",
      "لقاء عائلي غادي يزيد الترابط بينكم.",
      "فرصة للقراءة فمكتبة أو متجر كتب جديد.",
      "غادي تتعلم طريقة جديدة لتنظيم وقتك.",
      "لقاء مع جار قديم غادي يجدد الصداقة بينكم.",
      "فرصة للمشاركة فأنشطة مجتمعية محلية.",
      "اكتشاف مقهى أو مكان جديد تصبح تزوره باستمرار."
    ],
    
    "monthly_activity": [
      "جرب طبخة مغربية جديدة وشاركها مع العائلة.",
      "اقرأ كتاب بالدارجة أو عن الثقافة المغربية.",
      "زر مكان تاريخي فمدينتك وخذ صور تذكارية.",
      "تعلم كلمة جديدة باللغة الأمازيغية كل يوم.",
      "ساعد جار أو قريب فمشروع صغير.",
      "خصص يوم للراحة الكاملة بدون تكنولوجيا.",
      "اكتب قائمة بالنعم اللي عندك فالحياة.",
      "جرب نشاط رياضي جديد (يوغا، مشي، سباحة).",
      "زر سوق تقليدي واشتري حاجة مغربية أصيلة.",
      "اقضِ وقت مع الأطفال وامرح معاهم.",
      "خصص وقت للرسم أو التلوين حتى لو مبتدئ.",
      "اسمع موسيقى مغربية قديمة وحاول تتعرف على الفنانيين.",
      "اكتب رسالة شكر لشخص ساعدك فالماضي.",
      "جرب تمارين التأمل أو التنفس العميق.",
      "زر متحف أو معرض فني فمدينتك.",
      "تعلم تقنية جديدة للطبخ الصحي.",
      "خصص وقت للعناية بالنباتات أو الزراعة.",
      "اسمع بودكاست أو برنامج بالدارجة.",
      "شارك فأنشطة تطوعية فالمجتمع.",
      "جرب هواية يدوية (حياكة، نجارة، خياطة).",
      "زر حديقة عمومية وخذ وقت للاسترخاء.",
      "تعلم رقصة مغربية تقليدية.",
      "اكتب مذكراتك اليومية بالدارجة.",
      "خصص وقت للعب مع الحيوانات الأليفة.",
      "شارك فمسابقة أو تحدٍ فالمدينة ديالك."
    ],
    
    "motivational_challenge": [
      "حاول تكون لطيف مع 3 أشخاص مختلفين كل يوم.",
      "تعلم توقف التفكير السلبي وتستبدلو بالإيجابي.",
      "خصص 30 دقيقة كل يوم للتعلم الذاتي.",
      "حاول تمشي 5000 خطوة على الأقل كل يوم.",
      "اقرأ 10 صفحات من كتاب كل يوم.",
      "اشرب 8 أكواب ماء يومياً لمدة شهر.",
      "اكتب 3 أشياء ممتن عليها كل صباح.",
      "حاول تقلل السكر فالأكل لمدة أسبوع.",
      "خصص وقت للعائلة بدون هاتف كل يوم.",
      "تعلم مهارة جديدة فشهر واحد.",
      "حاول تصحى بدري كل يوم لمدة أسبوعين.",
      "نظم خزانة الملابس وتخلص من اللي ماتلبسوش.",
      "جرب تمارين التأمل لمدة 10 دقائق يومياً.",
      "حاول تكتب مذكراتك كل يوم لمدة شهر.",
      "خصص وقت للقراءة قبل النوم بدل الهاتف.",
      "تعلم طبخة جديدة كل أسبوع.",
      "حاول تكون أكثر صبراً فطوابير الانتظار.",
      "خصص وقت للرياضة 3 مرات فالأسبوع.",
      "حاول تقلل الشكوى وتزيد الشكر.",
      "تعلم تقنية جديدة للتركيز والإنتاجية.",
      "خصص وقت للمساعدة فالشغل المنزلي.",
      "حاول تكون أكثر تنظيماً فالمواعيد.",
      "تعلم تتحكم فالتوتر بطرق صحية.",
      "خصص وقت للراحة بدون شعور بالذنب.",
      "حاول تكون أكثر إيجابية فالحديث مع الناس."
    ],
    
    "social_advice": [
      "اسمع أكثر ما تهدر. الناس كتحب اللي يسمعهم.",
      "كن صادق فالمديح. الإطراء الصادق كيبني علاقات قوية.",
      "تعلم تمدح الناس فالمجهودات ديالهم الصغيرة.",
      "كن متسامح مع أخطاء غيرك. كل واحد عندو ظروفه.",
      "ابتسم أكثر. البسمة مجانية وتخلق جو إيجابي.",
      "كن داعم للأصدقاء وقت الحاجة. الوفاء كيبان فالضرة.",
      "تعلم تشارك نجاحات غيرك وتفرح ليهم.",
      "كن واضح فالحديث. التخمين كيخلق سوء تفاهم.",
      "تعلم تعتذر وقت الخطأ. الاعتزار علامة القوة.",
      "كن متفهم لاختلافات الناس. التنوع كيثرى الحياة.",
      "تعلم تمدح فالوقت المناسب. التوقيت مهم.",
      "كن متعاون فالمشاريع الجماعية. الفريق كيكمل بعضو.",
      "تعلم تسمع بدون مقاطعة. الاحترام كيبدا من السمع.",
      "كن دايما حاضر فمواعيدك. التأخير كيقلل الاحترام.",
      "تعلم تشارك المعرفة. العلم كيزيد بالنشر.",
      "كن صادق فالوعود. اللي ماكيديرش وعده، ماكيتحترمش.",
      "تعلم تعبر على الامتنان. الشكر كيزيد المحبة.",
      "كن داعم للآخرين فمحاولاتهم، حتى لو ما نجحوش.",
      "تعلم تضحك مع الناس، ماتضحكش على الناس.",
      "كن محافظ على خصوصية غيرك. الثقة كنعمة.",
      "تعلم تشارك الفرح. السعادة كتتضاعف بالنشر.",
      "كن متواضع فالنجاح. الغرور كيخسر الأصدقاء.",
      "تعلم تفتح مواضيع إيجابية فالحديث.",
      "كن دايما متواجد فالأوقات المهمة.",
      "تعلم تكون أنت فكل المواقف. التصنع ماكيدومش."
    ],
    
    "mini_quiz": [
      "شنو أحلى لحظة فهاد الأسبوع؟ جرب تكتاشفو مع صديق.",
      "من هو الشخص اللي كيضحكك دايما؟ اتصل بيه اليوم.",
      "شنو الحلم الصغير اللي كتمني تحققه هاد الشهر؟ ابدا فيه.",
      "من هو القدوة ديالك فالحياة؟ فكر فالصفات ديالو.",
      "شنو الهواية اللي كتمنى تتعلمها؟ اقرأ عليها شوية.",
      "في مدينة مغربية كتمنى تزورها؟ خطط للرحلة.",
      "شنو أكلة مغربية كتحبها؟ جرب تطبخها البارح.",
      "من هو صديق الطفولة اللي ماوصلتيش معاه؟ راسلو رسالة.",
      "شنو المهارة اللي عندك وتستاهل تطورها؟ ابدا اليوم.",
      "شنو أحلى ذكرى مع العائلة؟ شاركها مع قريب.",
      "من هو الشخص اللي علمك درس مهم فالحياة؟ اشكرو.",
      "شنو الكتاب اللي غير نظرتك للحياة؟ نوصي بيه لصديق.",
      "شنو العادة الحلوة اللي كتعملها كل يوم؟ حافظ عليها.",
      "من هو الجار اللي كتساعدو دايما؟ زورو اليوم.",
      "شنو الهدية الصغيرة اللي كتحب تديه لناس؟ جرب تعملها."
    ],
    
    "moroccan_joke": [
      "شحال هادي كتنضن الضو؟ هادي ما كيضحكش حتى هو.",
      "علاه كتقرا الكتاب؟ علاه ماكيناش فيديو؟",
      "اشنو الفرق بين الماطو والطالب؟ الماطو كيتحرك.",
      "كيفاش تعرف بلي الدجاجة مغربية؟ كتهدر بالدارجة.",
      "علاه الطاجين ماكيناش عاجل؟ علاه كياخد الوقت ديالو.",
      "شنو قال الماطيريال للطريق؟ يلا نهارك بلا حوادث.",
      "كيفاش تعرف بلي السمك مغربي؟ كيسبح فالاتجاه المعاكس.",
      "علاه كتجي الساعة فالوقت؟ علاش ما جاتش البارح؟",
      "شنو قال الشاي للسكر؟ أنا ونيتي ما كنيش ليك.",
      "كيفاش تعرف بلي الحاسوب مغربي؟ كيهدر وكاتفهم عليه."
    ],
    
    "motivational_phrase": [
      "اليوم هو أول يوم فباقي حياتك. عيشو باللي خير.",
      "الصبر مفتاح الفرج، والتسرع مفتاح الندم.",
      "الضحكة مجانية، لكن قيمتها لا تقدر.",
      "كل يوم فرصة جديدة لتبدأ من جديد.",
      "الإنسان كالشجرة، كلما تعمقت جذوره، ارتفعت أغصانه.",
      "النجاح مش وصول، هو رحلة مستمرة.",
      "أحسن استثمار هو الاستثمار فالنفس.",
      "البساطة هي الإبداع فأنقى صوره.",
      "العقل الهادئ كيبدع أكثر من العقل المزدحم.",
      "الحياة قصيرة، عيش اللحظات الحلوة."
    ],
    
    "lucky_number": [
      "3", "7", "11", "14", "18", "21", "23", "27", "29", "31",
      "5", "9", "12", "16", "19", "22", "24", "26", "30", "8",
      "2", "13", "17", "25", "28", "32", "4", "10", "15", "20"
    ],
    
    "lucky_day": [
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد",
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد",
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد"
    ]
  }
}
