{
  "free_sections": {
    "personality": [
      "نتا شخصية قوية وهادئة، كتعرف تاخد القرارات فالصعيب. قلبك كبير ودايما كتحاول تساعد النايبين عليك.",
      "ناس كيقولو عليك متسرع، ولكن الحقيقة بلي كتعرف شنو كبغي من لحياة. عندك بصيرة حادة.",
      "شخصية كتخش لقلوب الناس بسهولة. عندك الكاريزما والذكاء العاطفي اللي كيخليو الناس يثقو فيك.",
      "نتي بنت الحكمة والطمأنينة. كتعرفي تربي الضحكة والجدية فآن واحد، وهادي موهبة نادرة.",
      "عندك روح المغامرة وكتبغي التجديد، ولكن فالنفس الوقت عندك جذور عميقة فالعائلة والتقاليد.",
      "شخصية فنية وخلاقية، كتشوفي الجمال فالأشياء البسيطة وكتعرفي تعبرو بطريقتك الخاصة.",
      "كتمشي فالحياة بحذر وحكمة، كتاخد الوقت باش تتفكري قبل ما تدي أي رد فعل.",
      "عندك الطاقة الإيجابية اللي كتنشر الضو فلمكان اللي كتدخليه. الناس كيبغيو يقربو منك.",
      "قلبك ناعم وحساس، كتتأثري بسرعة بالقصص والمشاعر، ولكن فالنفس وقت كتعرفي تبانو قوية.",
      "عندك الذكاء العملي، كتعرف تحل المشاكل بطرق مبتكرة وخارجة على المألوف.",
      "نتا الصديق الوفي، اللي كاينين عليه فالصح والضرة. عندك موهبة فسماع الناس.",
      "شخصية مليحة فالتعامل مع التحديات. العوائق كتجيب منك أحسن ما عندك.",
      "عندك حس فالدعابة وكتعرف تبدد التوتر فالجلسات. الضحكة ديالك علاج للناس اللي حوليك.",
      "كتهتمي بالتفاصيل الصغيرة اللي كاتفرق. عيناك كتشوفو أشياء كاتهرب على غيرك.",
      "نتا الهادئ فالعاصفة، اللي كيبان فالمواقف الصعبة وكاتهدي الرايبين.",
      "عندك الطاقة القيادية، ولكن بدون ما تكون متسلط. كتخلي الناس يتبعوك بحب واحترام.",
      "شخصية متواضعة ومتقدرة، كتعرف قيمة الأشياء البسيطة فالحياة.",
      "عندك المثابرة والصبر. المشاريع اللي كتبدئيها كتكملوها لين آخرها.",
      "كتهتمي بالروحانيات والمعاني العميقة. حياتك مزيان بين المادي والروحي.",
      "نتا الجسر بين الأجيال، كتفهمي الشباب والكبار وكتعرفي تواصلي بيناتهم."
    ],
    "prediction_2026": [
      "2026 غادي يكون عام التغييرات الإيجابية. غادي تكتشف قدرات جديدة فالشخصية ديالك.",
      "عام 2026 غادي يجيب معاه فرص جديدة فالمجال المهني. كوني مستعدة للمفاجآت الحلوة.",
      "ف2026، العلاقات القديمة غادي تبان من جديد، ولكن بطاقة جديدة ومغايرة.",
      "غادي تكون تحولات فطريقة التفكير ديالك، وتجديد فالنظرة للحياة والعالم.",
      "2026 عام الرحلات والاكتشافات، حتى لو كانت رحلات روحية أو فكرية.",
      "غادي تتعلم مهارات جديدة تخدمك فالمستقبل وتفتح لك أبواب ماكنتيش تتصوريهم.",
      "فهاد العام، الصبر ديالك غادي يبدا يبدا يبدا يعطي ثمار. الثقة فالوقت.",
      "علاقات عائلية غادي تشد أقوى، وذكريات جديدة غادي تتخلق مع الناس اللي تحبيهم.",
      "غادي تكون سنة الوفاء مع الذات، ومعرفة أكبر شنو كنبغي وخاينو فالحقيقة.",
      "2026 غادي يجيب معاه الاعتراف بالتعب ديالك والمجهودات اللي دايرها من زمان.",
      "فرصة لفهم أعمق ديال نفسك والناس اللي حوليك. الحكمة غادي تكبر فقلبك.",
      "سنة الهدوء الداخلي والطمأنينة، حتى لو الدنيا برا كاتكون مضطربة.",
      "غادي تلقى الحلول للمشاكل اللي كانت كاتقلقك من سنين. الضو فآخر النفق.",
      "تحقيق أحلام قديمة، ولكن بطريقة مختلفة عما كنتي تتخيلي. أحلى من التخيل.",
      "2026 عام العطاء، كتدي وكتاخد. الكرم ديالك غادي يرجع ليك مضاعف.",
      "سنة البدايات الجديدة، مشاريع وأفكار كتغييرو مسار حياتك فالإيجاب.",
      "غادي تتعلم تسامح أكثر، مع غيرك ومع نفسك. السلام الداخلي غادي يزيد.",
      "اكتشاف مواهب مخبية فالشخصية ديالك، وقدرات ماكنتيش واعية بيهم.",
      "عام التوازن بين المسؤوليات والمتعة. تعلم تدير وقتك بطريقة أحسن.",
      "سنة اللقاءات المؤثرة، ناس جدد غادي يدخلو حياتك ويقدمو قيمة كبيرة."
    ]
  },
  "premium_sections": {
    "advice": [
      "خلي الضحكة ديالك تبان أكثر. العالم محتاج للضو اللي عندك.",
      "سجل الذكريات الحلوة. كاتساعدوك وقت الضيق.",
      "تعلم تقول لا وقتاش الحاجة ماكاتناسبكش. هادي حرية.",
      "خصص وقت للقراءة. الكلمات كتعلم وتفتح آفاق جديدة.",
      "سافر حتى لو لوحدك. الرحلات لوحدها كتعطي دروس خاصة.",
      "تعلم فن الصمت. فالصمت كتسمع صوت قلبك وصوت الحكمة.",
      "اقبل التغيير. الحياة ماكاتوقفش، والتكيف هو الحل.",
      "اشكر على النعم الصغيرة. الشكر كيزيد النعم.",
      "خلي عندك حلم كبير، ولكن ابدا بخطوات صغيرة.",
      "سامح، ولكن خلي الدرس يضل. التسامح للراحة ديالك.",
      "تعلم من الأطفال. عندهم دروس فالبساطة والفرحة.",
      "كون صادق مع نفسك. الحقيقة مع النفس هي الأساس.",
      "خصص وقت للطبيعة. كتضبط إيقاع القلب والفكر.",
      "حافظ على العلاقات اللي كتجيب ليك الطمأنينة.",
      "جرب حاجات جديدة، حتى لو خايف. النمو خارج منطقة الراحة.",
      "كون لطيف مع نفسك. ماكاتطلبش من راسك أكثر من اللي تقدر.",
      "ساعد غيرك حتى لو ببسمة. العطاء كيرجع بطريقة ما.",
      "ثق فالحدس ديالك. غالبا عندو معلومات ماكاتوصلولهاش العقل.",
      "خلي الحياة سهلة. ما تعقدها بالمبالغة فالتحليل.",
      "عيش اللحظة. الماضي راح، والمستقبل باقي، والحاضر هو اللي كاين."
    ],
    "warning": [
      "حذار من الثقة العمياء. كوني واعية وفرق بين الطيب والساذج.",
      "لا تهمل الصحة ديالك فوسط الانشغالات. الجسد غالي.",
      "حذار من التأجيل. الوقت اللي كيمشي ماكاتجيبوش لوراك.",
      "لا تخلط بين التواضع والنقص فالثقة فالنفس. أنت عندك قيمة.",
      "انتبه من الحكم على الناس بسرعة. غالبا في حكاية مليحة موراهم.",
      "حذار من الغضب اللي كيخليك تهدر كلمات ماكاتبغيش.",
      "لا تنسى تخصص وقت للراحة. الماطيريال ماكاتشّي غير بالبنزين.",
      "انتبه من المقارنات. كل شخص عندو مسارو وتحدياتو الخاصة.",
      "حذار من الفراغ العاطفي. املاه باشغال ومشاريع مفيدة.",
      "لا تهمل العلاقات القديمة اللي كانت عندها قيمة فحياتك.",
      "انتبه من القرارات المتسرعة وقت الغضب أو الفرح الشديد.",
      "حذار من النسيان ديال الذات. كوني موجودة لنفسك قبل ما تكوني للناس.",
      "لا تتصور بلي كلشي غادي يضل زيه. التغيير جزء من الحياة.",
      "انتبه من الطاقة السلبية اللي كيجيبوها ناس معينين.",
      "حذار من الروتين القاتل. خلي في مجال للتجديد فالحيوات.",
      "لا تعطي أكثر من اللي عندك. الإرهاق ماكاتخدمش معاه.",
      "انتبه من الأحكام المسبقة. افتح قلبك وعقلك للتجارب الجديدة.",
      "حذار من الكتمان الزايد. التعبير على المشاعر ضروري.",
      "لا تهمل العلامات الصغيرة. غالبا هي اللي كتجي بالخبر الكبير.",
      "انتبه من التركيز على الماضي. العيش فالحاضر هو اللي كيبنى المستقبل."
    ],
    "strength": [
      "القوة ديالك هي الصبر. الصبر ديالك ماكاتلحقوش النار.",
      "الحدس القوي. غالبا كتكوني محقة فالمواقف اللي كتعتمدي فيها على الحدس.",
      "القدرة على التكيف. كتعرف تتأقلم مع التغييرات بسرعة وذكاء.",
      "الطيبة ديالك هي سلاحك. كتجذب ليك الخير والناس الطيبين.",
      "العزيمة. ماكاين حاجة كاتوقفك وقتاش كتشدّي القرار.",
      "الحكمة فالحديث. كتعرفي وقتاش تهدرى ووقتاش تسكتى.",
      "القدرة على التسامح. كتعرف تسامح ولكن بدون ما تنسى الدرس.",
      "الطاقة ديالك كتعدي للناس. كتخلق جو إيجابي فالمناطق اللي كتمرو منها.",
      "النظرة الإيجابية. كتشوفي الفرص فالعرايق كاملة.",
      "الوفاء. نتا الوفي للناس وللمبادئ ديالك.",
      "التواضع. حتى واخا عندك إنجازات، كتضل متواضع ومقدر للنعم.",
      "المرونة الفكرية. كتعرف تغير رأيك وقتاش كتكتشف معلومات جديدة.",
      "القدرة على الإصغاء. كتسمع الناس بحق، وهادي صفة نادرة.",
      "حسك الفني. كتعرف تعبر على مشاعرك وأفكارك بطرق إبداعية.",
      "الاستقلالية. كتعرف تدبر حالك وتحقق أهدافك براسك.",
      "الذكاء العاطفي. كتفهم مشاعر غيرك ومشاعرك ديرك.",
      "المثابرة. كتكمل المشاريع لين آخرها، حتى لو واجهتك صعوبات.",
      "الفضول الإيجابي. كتبغي تتعلم وتكتشف أشياء جديدة دايما.",
      "الشجاعة فقول الحق. كتعرف تهدر بالصحيح حتى لو كان مر.",
      "القدرة على إسعاد غيرك. كتعرف تفرح الناس بتفاصيل صغيرة."
    ],
    "lucky_number": [
      "3", "7", "11", "14", "18", "21", "23", "27", "29", "31",
      "5", "9", "12", "16", "19", "22", "24", "26", "30", "8"
    ],
    "lucky_day": [
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد",
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت", "الأحد",
      "الاثنين", "الثلاثاء", "الأربعاء", "الخميس", "الجمعة", "السبت"
    ]
  }
}
